{"maximumSentences":7,"searchTerm":"ipoteca","prefix":"O que é","lang":"en","sourceContentOriginal":"The 2011–12 season was Associazione Calcio Milan's 78th season in Serie A, and their 29th consecutive season in the top-flight of Italian football. Milan were the defending Serie A champions, and they were aiming for a second straight title. Despite a slow start, they had been able to build up a four-point lead in the table over Juventus by 11 March. In the last nine games of the season, however, Milan picked up only five wins, with two draws and two losses, allowing Juventus, who instead recorded ten wins and one draw over their last 11, to regain the lead and win the title by four points.\nAs the previous year's Serie A champions, Milan began their season contesting the Supercoppa Italiana against Coppa Italia holders Internazionale, winning the match 2–1. The Rossoneri also competed in the UEFA Champions League, reaching the quarter-finals where they were eliminated by Barcelona, and took part in the Coppa Italia as well, being knocked out in the semi-finals against Juventus.\n\n\n== Pre-season and friendlies ==\nMilan began their pre-season training at Milanello on Tuesday, 12 July 2011. The following week, on 20 July, they contested the first friendly, an away match against neighboring side Solbiatese Arno. The Rossoneri easily won with a score of 12–0.As part of the Audi Cup, Milan then played two friendlies against Bayern Munich and Internacional at the Allianz Arena in Munich on 26 and 27 July, respectively. The first game finished 1–1. Zlatan Ibrahimović opened the scoring only for Toni Kroos to equalize late in the first half. Milan subsequently lost 5–3 on penalties, with Alberto Paloschi committing the only, and eventually deciding, error. The second game was a 2–2 draw. Ibrahimović once again opened the scoring, before Leandro Damião equalized in the 20th minute, and then Milan took a new lead through Alexandre Pato in the 60th minute only for Andrés D'Alessandro to tie the game ten minutes from time. The Rossoneri were defeated 2–0 on penalties, being unable to convert any of their four attempts.After travelling to China, where they played their first competitive match of the season, a 2–1 win over city rivals Internazionale in the Supercoppa Italiana on 6 August, Milan resumed their pre-season schedule facing Malmö FF in Sweden on 14 August. The Rossoneri took the lead in 27th minute when Urby Emanuelson raced into the box and crossed the ball to Antonio Cassano, who easily headed it in. Malmö equalised nine minutes later through Jimmy Durmaz, who curled a shot from just outside the penalty area. Three minutes into the second half, Malmö took a 2–1 lead when Tobias Malm stole the ball in midfield, combined with Alexander Nilsson and finally beat Milan goalkeeper Christian Abbiati. Milan managed to equalise in the last minute of the game, as a cross by Cassano was headed in by youth team player Kingsley Boateng. With no extra time, the match was to be decided by a three-kick penalty shoot-out, which Milan won 3–2, as Abbiati pulled off a save on Malmö's third attempt.Four days later, Milan returned to Italy to contest the TIM Trophy. They took on Juventus in the second game of the evening, after the latter had lost the first game to Inter on penalties. Milan took the lead in the 13th minute through Antonio Cassano, but Juventus fought back, equalising eight minutes later with Arturo Vidal and scoring the winning goal in injury time through Alessandro Matri. The Rossoneri also lost the third and final game against Inter, with Diego Milito scoring the lone goal, thus allowing them to win the trophy.Milan concluded their pre-season with the annual Luigi Berlusconi Trophy, in which they played against Juventus at the San Siro on 21 August. Kevin-Prince Boateng opened the scoring for the Rossoneri in the ninth minute, volleying past Juventus goalkeeper Gianluigi Buffon from a cross by Ignazio Abate. Fourteen minutes later, Milan doubled their lead, as Clarence Seedorf scored with a curled free-kick off the post. In the second half, Milan players looked more tired and Juventus managed to pull one back through Mirko Vučinić, but the Rossoneri held on to win the game 2–1.Following the players' strike that forced the postponement of the first weekend of league fixtures, however, Milan announced they would play another friendly match, away against Como, on 1 September. The Rossoneri took the lead in the 22nd minute through Massimo Ambrosini, who was set up by Stephan El Shaarawy, but the hosts equalised two minutes later with a goal from Umberto Miello. In the second half, Urby Emanuelson converted a penalty to give Milan the final lead.On 4 January 2012, Milan played their first game of the new year with a friendly against French side Paris Saint-Germain in Dubai for the Emirates Challenge. The game got off to a good start for Milan as Ibrahimović drew the goalkeeper out of his goal and passed to Alexandre Pato for the opener in the fourth minute. The game progressed with neither team looking much better than the other, but both could not convert any more chances and the game ended 1–0 in Milan's favour.  Win\n  Draw\n  Loss\n\n\n== Supercoppa Italiana ==\n\nAs Serie A Champions, Milan kicked their season off with an appearance in the Supercoppa Italiana, facing Coppa Italia holders, Internazionale at the Beijing National Stadium on 6 August. Inter took the lead after 21 minutes with a 25-yard free kick by Wesley Sneijder. Later on, the Rossoneri nearly leveled the score when a header by Zlatan Ibrahimović struck the post. On the hour mark, Milan managed to equalise, as Ibrahimović headed into an empty net a cross by Clarence Seedorf. Ten minutes later, a shot by Alexandre Pato was deflected by Inter goalkeeper Júlio César on the post only for Kevin-Prince Boateng to convert from close range, setting the final score to 2–1. For Milan, it was the sixth time they won the trophy, making them the most successful club in the history of the competition.  Win\n  Draw\n  Loss\n\n\n== Serie A ==\n\nThe fixtures for the 2011–12 Serie A season were announced by the Serie A on 27 July. Milan were to kick-off their schedule away at Cagliari on Saturday, 27 August, but following a strike declared by Serie A players over the lack of a collective bargaining agreement, the first day of the league season has been postponed to a future date.Following another week off for an international break, Milan started their season, playing host to Lazio on Friday, 9 September. A few minutes into the game, newly signed Alberto Aquilani broke into the Lazio penalty area, but one on one with goalkeeper Albano Bizzarri, he fired straight at him. Instead, it was Lazio who took the lead, as in 12th minute Miroslav Klose took down Stefano Mauri's cross, turned inside Alessandro Nesta and beat goalkeeper Christian Abbiati. Less than ten minutes later, Lazio scored again through Djibril Cissé, who headed in another cross by Mauri. Milan pulled one back in the 29th minute, when Antonio Cassano, set up by Aquilani inside the box, passed the ball to Zlatan Ibrahimović for the tap-in. Four minutes later, Cassano himself tied the game with a header from a corner. Eighteen minutes into the second half, Cassano went close to find the winning goal, hitting the outside of the left post. Lazio had a chance of his own two minutes later, as Cissé nudged the ball past Abbiati and heading to the goal, before Nesta managed to touch it wide. The match finished in a 2–2 draw.For the next game, Milan travelled to Naples to take on Napoli in the evening of Sunday, 18 September. Both teams had played Champions League ties in midweek, Milan drawing 2–2 at Barcelona on Tuesday and Napoli drawing 1–1 at Manchester City on Wednesday. The Rossoneri were also in the midst of an injury crisis, with as many as seven players out, including the previous season's topscorer, Zlatan Ibrahimović. Nonetheless, Milan took the lead eleven minutes into the game through Alberto Aquilani, who scored his first goal for the club, heading Antonio Cassano's cross past Napoli goalkeeper Morgan De Sanctis. The hosts reaction came only two minutes later, as Edinson Cavani found the equaliser following a free-kick. Napoli started to press forward and in the 36th minute they went ahead with another goal by Cavani on a fast-paced counter-attack. Milan had a chance to pull level when Aquilani was once again set up inside the box by Cassano, but the effort was denied by De Sanctis' save. A few minutes after the break, Cavani completed his hat-trick, making it 3–1 after Milan's defence failed to clear the ball inside the area. The Rossoneri tried to fight back but produced no major threats until the final whistle.Three days later, Milan took the field again, playing host to unbeaten Udinese at the San Siro. The Rossoneri lost Alexandre Pato to an injury in the 21st minute and eight minutes later they went down 1–0, as goalkeeper Christian Abbiati failed to control a cross by Gabriel Torje, fumbling the ball for an Antonio Di Natale empty net tap-in. Moments before the interval, Milan nearly leveled the score when a free-kick from just outside the penalty area by Clarence Seedorf struck the post to the left of goalkeeper Samir Handanović. Eighteen minutes into the second half, the Rossoneri did tie the game: Antonio Cassano set up Stephan El Shaarawy inside the box for the Italian to fire home a low drive to the far post. Udinese later had three chances to win before the final whistle, hitting the woodwork once and then forcing Abbiati to make two crucial saves to preserve the 1–1 tie.Pato's absence intensified Milan's already deep injury crisis, as he joined strikers Zlatan Ibrahimović and Robinho, midfielders Massimo Ambrosini, Kevin-Prince Boateng, Gennaro Gattuso and Mathieu Flamini and defenders Luca Antonini, Daniele Bonera and Philippe Mexès on the sidelines. Nonetheless, on Saturday, 24 September, Milan achieved their first league win of the season, beating Cesena 1–0 at the San Siro. Clarence Seedorf scored the lone goal, firing a 25-yard curled shot, following a corner kick.After defeating Viktoria Plzeň in their midweek Champions League game, Milan travelled to the Juventus Stadium in Turin to take on a still-unbeaten Juventus on Sunday, 2 October. The hosts created several scoring chances in the first half and came close to scoring in the 37th minute, as Mirko Vučinić hit the crossbar with a right-footed shot from the edge of the area. The home side came close to scoring again moments before the break, but Vučinić's drive went just wide of the far post. Juventus kept pressing forward after the break and nearly scored with Leonardo Bonucci, who was palmed over the bar by Milan goalkeeper Christian Abbiati. Milan then had an opportunity of their own, but Kevin-Prince Boateng was denied by Juventus goalkeeper Gianluigi Buffon. Three minutes from time, however, Juventus took the lead: Daniele Bonera's clearance deflected off Claudio Marchisio and into the net. Seconds later, the Rossoneri were left down to ten men with Boateng being sent off for second yellow card. In injury time, Marchisio set the final score to 2–0, as his volley from outside the box went in between Abbiati's legs.After an international break, Milan played host to Palermo on Saturday, 15 October. The Rossoneri were dangerous from the whistle, with Ibrahimović and Cassano forcing multiple saves from goalkeeper Alexandros Tzorvas. Tzorvas also denied Robinho in the 38th minute, parrying an initial shot straight back to the Brazilian and then deflecting the follow-up effort. Milan, however, took the lead one minute later when Ibrahimović provided a cross to Alberto Aquilani, who headed the ball to Antonio Nocerino for a close range tap-in. Ibrahimović also provided the assist for Milan's second goal in the 55th minute, delivering a pin-point pass to Robinho who beat Tzorvas one-on-one. Eight minutes later, Cassano set the final score to 3–0, firing home a pass from Ignazio Abate.After defeating BATE Borisov in their Champions League game, Milan traveled to the Stadio Via del Mare on Sunday, 23 October to take on Lecce, whom they had not beaten away from home in ten years. Guillermo Giacomazzi gave Lecce the lead in the fourth minute with a deft headed flick from Carlos Grossmüller's in-swinging free-kick, taking the ball past goalkeeper Christian Abbiati. Milan had a couple of chances but could not convert them, and in the 30th minute Abbiati was called for a foul on Daniele Corvia after he spilled a caught ball from a corner, with the referee awarding a penalty, despite replays seeming to show that it was a dive by the player. Former Milan player Massimo Oddo converted to put Lecce up 2–0. Milan continued to make defensive mistakes when in the 37th minute Luca Antonini let his blocked ball slip to Grossmüller who fired hom to make it 3–0 for Lecce before halftime. The second half began with Kevin-Prince Boateng and Alberto Aquilani replacing Massimo Ambrosini and Robinho. These substitutions proved crucial, as Boateng scored a hat-trick within a span of 14 minutes to put Milan level at 3–3, before Mario Yepes converted a cross by Antonio Cassano with a header into the top right corner to complete Milan's comeback in the 83rd minute.Three days later, Milan played host to Parma at the San Siro. Milan started the game with confidence, controlling much of the play and in the 30th minute Antonio Nocerino gave Milan the lead with a left-footed shot into the bottom left corner of the net after the ball rebounded off a Parma player. He doubled his tally two minutes later with a left-footed strike from outside the box, making the scoreline 2–0 for Milan. In the 73rd minute, Ibrahimović added to Milan's lead with a right footed shot from the centre of the box to the bottom right corner, assisted by Antonio Cassano with a headed pass following a fast break. Five minutes later though, Sebastian Giovinco scored a consolation goal for Parma as he threaded the ball through Christian Abbiati's legs to make it 3–1. Yet, in the dying minutes of the game, Nocerino completed his hat-trick with a headed goal into the bottom left corner of Antonio Mirante's net to win it for Milan 4–1.Milan completed a three-game week visiting the Stadio Olimpico to take on Roma on Saturday, 29 October. The Rossoneri started the game well, getting ahead in the 17th minute with Zlatan Ibrahimović, who got behind an Alberto Aquilani cross from the right and placed a headed shot into the right side of Roma goalkeeper Maarten Stekelenburg's net. Roma struggled to break Milan's defence until the 28th minute when Nicolás Burdisso scored his first goal of the season by running into the six-yard box to meet Miralem Pjanić's cross with his head and beating Milan goalkeeper Abbiati. Roma's joy was short-lived, however, as Milan went back in front two minutes later: Robinho's corner was met by Alessandro Nesta, who nodded past Stekelenburg. In the 65th minute, Boateng was sent off right after being substituted for saying something to the fourth official. Roma could not get back on terms, and Milan were soon back on the attack and celebrating their third goal as Ibrahimović headed in a cross by Aquilani into the bottom left-hand corner of the goal. The game had not concluded, however, and in the 87th minute Bojan struck the ball into the back of the net after Abbiati was unable to hold on to substitute Erik Lamela's strike. Shortly after, Milan coach Massimiliano Allegri was sent off for protesting about a throw-in, but the game ended with Milan taking the victory by 3–2.After drawing 1–1 in their mid-week Champions League game against BATE Borisov, Milan played host to Catania on Sunday, 6 November. Seven minutes into the game, Robinho was brought down by Davide Lanzafame inside the box and Milan were awarded a penalty, which Ibrahimović converted for the 1–0 lead. The lead was doubled in the 24th minute through Robinho, who beat Catania's goalkeeper Mariano Andújar on the far post, following a pinpoint pass by Ibrahimović. In the second half, the Rossoneri added other two goals to their tally: in the 69th minute, when Catania's Francesco Lodi deflected Robinho's shot into his own net, and three minutes later through Gianluca Zambrotta, whose left-footed strike made it 4–0.Following a two-week break for internationals, Milan resumed his league schedule in Florence to take on Fiorentina on Saturday, 19 November. The game ended in a scoreless draw, though Clarence Seedorf had a goal disallowed for offside in the first half, despite replays showing that he actually was in line. The following week, after losing to Barcelona in a mid–week Champions League game on Wednesday, the Rossoneri defeated Chievo 4–0 at home on Sunday, with first-half goals by Thiago Silva, Ibrahimović twice and Pato. Milan took the field again to face Genoa at the Stadio Luigi Ferraris on Friday, 2 December. After a goalless first half, Milan went ahead in the 56th minute thanks to a penalty earned and converted by Ibrahimović. Eleven minutes from time, Antonio Nocerino made it 2–0.After playing their last Champions League group stage game – an away draw against Viktoria Plzeň – on Tuesday, Milan travelled to the Stadio Renato Dall'Ara to face Bologna on Sunday, 11 December. The hosts took the lead in the 11th minute through their captain Marco Di Vaio, who beat Milan back-up goalkeeper Marco Amelia with a long-range lob following a counter-attack. Five minutes later, Boateng combined with Seedorf and the Dutch fired home the equaliser in the top corner from just outside the penalty box. Milan went ahead in the 21st minute of the second half with a penalty earned and converted by Ibrahimović. Less than two minutes later, though, Alessandro Diamanti tied the game up again as his angled shot from outside the box was not held by Amelia, setting the final score to 2–2.The following week, Milan played host to Siena. The visitors almost went ahead in the 23rd minute, when Francesco Bolzoni tipped the ball past Milan goalkeeper Marco Amelia, but his shot went outside of the far post. Nine minutes into the second half, however, Seedorf's corner was laid back by Robinho to Antonio Nocerino, who fired home a low shot into the bottom corner to give Milan the lead. Eight minutes later, the Rossoneri were awarded a penalty as Boateng was apparently brought down by Siena goalkeeper Željko Brkić; Ibrahimović stepped up to score from the spot as Milan went on to win the game 2–0.Milan played their last game before the winter break away against Cagliari on Tuesday, 20 December. They took the lead four minutes into the games with an own goal by Cagliari defender Francesco Pisano, who deflected Robinho's cross into his own net in an attempt to prevent Antonio Nocerino from reaching the ball. Albin Ekdal nearly leveled the score with a 30-yard shot ten minutes later, but his effort was denied by Abbiati. Abbiati pulled off another save on a header by Víctor Ibarbo in the early stages of the second half. On the hour mark, Milan doubled their lead, as Ibrahimović combined with Robinho and put the ball past Michael Agazzi.Milan resumed their league schedule on Sunday, 8 January, taking on Atalanta in Bergamo. The hosts had the first scoring opportunities of the game, first with Ezequiel Schelotto and then with Simone Padoin. However, Milan were awarded a penalty in the 22nd minute, as Pato was brought down by Thomas Manfredini. Ibrahimović converted to give the Rossoneri the lead. In the second half, Atalanta came close to tie the game as Germán Denis' header hit the woodwork, but with eight minutes left, Ibrahimović picked out Boateng in the centre of the penalty area and the Ghanaian struck it home, setting the final score to 2–0.The following week, Milan faced city rivals Internazionale. Five minutes into the game, Inter had a goal disallowed for offside. In the last minute of the first half, Mark van Bommel hit the crossbar with a shot from outside the box and Inter goalkeeper Júlio César then denied Urby Emanuelson's effort on the rebound. Inter opened the scoring in the 54th minute: Milan defender Ignazio Abate failed to intercept a crossfield pass and slipped, allowing Diego Milito to receive the ball and score. The game ended 1–0, as Milan did not manage to pose any major threat in the remaining part of the game.After defeating Novara in the Coppa Italia round of 16 in mid-week, Milan travelled to the Stadio Silvio Piola to take them on again in a league game on Sunday, 22 January. The Rossoneri claimed a 3–0 win with two second-half goals by Ibrahimović and one by Robinho.The following week, Milan defeated Lazio in the Coppa Italia quarter-finals on Thursday, before taking on Cagliari at home on Sunday. The Rossoneri took the lead in the 32nd minute, as Ibrahimović fired home a free kick from 25 yards. Seven minutes later, he provided an assist to Antonio Nocerino, who volleyed the ball for the 2–0 lead. Fifteen minutes from time, Massimo Ambrosini scored Milan's third and final goal after coming off the bench eight minutes earlier.Three days later, Milan took the field again for a mid-week game against Lazio in Rome. After a goalless first half, the hosts took the lead in the 76th minute, when Tommaso Rocchi fed Hernanes inside the box and the Brazilian scored with a right-footed strike towards the left corner of Abbiati's goal. Nine minutes later, following a fast counter-attack, Rocchi himself beat Abbiati again with a volley off Senad Lulić's cross, setting the final score to 2–0.Milan played host to Napoli on Sunday, 5 February. The game ended in a scoreless draw, with the Rossoneri ending the game down to ten men as Ibrahimović was ejected in the 64th minute for slapping Napoli defender Salvatore Aronica during an altercation.After losing to Juventus at home in the Coppa Italia semi-finals first leg in mid-week, Milan travelled to Stadio Friuli to face Udinese on Saturday, 11 February. The hosts took the lead in the 17th minute through Antonio Di Natale, who collected the ball after a combination with Gélson Fernandes and fired a shot that deflected off Milan defender Thiago Silva and into the net. Udinese had chances to double their lead but failed to do so. With 13 minutes remaining, substitute Maxi López equalised, nodding the ball in after a shot by Stephan El Shaarawy was saved by Udinese goalkeeper Samir Handanović. Eight minutes later, López provided El Shaarawy with the assist for the winning goal.Following a mid-week home victory against Arsenal in the Champions League round of 16, Milan took on Cesena at the Stadio Dino Manuzzi on Sunday, 19 February. The Rossoneri started the game aggressively with several goal attempts in the opening minutes. Two minutes before the half hour mark, Milan finally managed to score through Sulley Muntari. The Ghanaian, at his debut with the Rossoneri, found the back of the net on a rebound after Cesena goalkeeper Francesco Antonioli saved Thiago Silva's free-kick. A couple of minutes later, Urby Emanuelson combined with Robinho and made it 2–0 with a left-footed strike from outside the box. The hosts looked more dangerous at the beginning of the second half as the unmarked Adrian Mutu headed over from close range. Milan, however, increased their lead in the 55th minute as Ignazio Abate set up Robinho inside the box and the Brazilian beat Antonioli. Ten minutes later, Cesena pulled one back through Daniel Pudil but eventually the game ended 3–1.With team top-scorer Zlatan Ibrahimović serving the last of a three-game suspension and midfielders Clarence Seedorf, Kevin-Prince Boateng and Alberto Aquilani out due to injury, Milan played host to Juventus on Saturday, 25 February. Milan took the lead after 14 minutes, with a shot from outside the box by Antonio Nocerino. Later on, Sulley Muntari seemed to have made it 2–0 when his headed effort was saved by Juventus 'keeper Gianluigi Buffon inside the line, but the referee did not award the goal. Seven minutes from time, Alessandro Matri pulled off an equaliser with a volley from close-range.The following Saturday, Milan travelled to the Stadio Renzo Barbera to take on Palermo. The returning Ibrahimović moved to the top of the scorers table as he scored a hat-trick between the 21st and the 35th minute to give Milan a 3–0 lead. Five minutes later he came close to score a fourth, but Palermo goalkeeper Emiliano Viviano denied him from close range. In the second half, Thiago Silva added to Milan's tally with a header off Stephan El Shaarawy's cross, setting the final score to 4–0.After losing the second leg of the Champions League round of 16 against Arsenal in mid-week, Milan played host to Lecce on Sunday, 11 March. The Rossoneri took an early lead on six minutes, as Antonio Nocerino fired home off Zlatan Ibrahimović's pass. In the second half the Swede himself made it 2–0 with a strike from outside the box. As Juventus drew their game away at Genoa, Milan extended their lead at the top of the league table to four points. Milan went on to win 2–0 away at Parma the following Saturday, thanks to a penalty converted by Ibrahimović in the 17th minute and a second half goal by Urby Emanuelson.After playing the return leg of the Coppa Italia semi-finals in mid-week, Milan played host to Roma on Saturday, 24 March. Despite having several scoring chances, they went behind one minute before the interval as Pablo Osvaldo fired home from close range after Daniele De Rossi's pass. Eight minutes into the second half, however, the Rossoneri were awarded a penalty due to a handball by De Rossi, which Ibrahimović converted to tie the game. The Swede almost put Milan in front with a free-kick which went just over the bar and then Roma goalkeeper Maarten Stekelenburg deflected Sulley Muntari's attempt onto the bar. With seven minutes remaining, Ibrahimović found the winning goal heading home Muntari's cross from close range.The following week, after drawing against Barcelona in the first leg of the Champions League quarter-finals on Wednesday, Milan travelled to the Stadio Angelo Massimino to face Catania on Saturday, 31 March. The visitors nearly took the lead through Urby Emanuelson, who failed to beat goalkeeper Juan Pablo Carrizo in a one-on-one situation on seven minutes. Ten minutes later, Carrizo denied Zlatan Ibrahimović, before Catania had a chance with Gonzalo Bergessio heading over the crossbar. In the 35th minute, Ibrahimović played the ball through for Robinho, who beat Carrizo with a low shot into the bottom corner, putting Milan ahead. Catania reacted immediately with Alejandro Gómez firing a shot from outside the penalty area and hitting the crossbar. Early in the second half, Gómez was controversially denied an equaliser for offside, despite the Argentinian striker appearing to be in an onside position. However, the hosts did tie the game in the 57th minute through Nicolás Spolli, who beat Christian Abbiati from close range after Nicola Legrottaglie headed Gómez's free-kick towards him. Nine minutes later referee Mauro Bergonzi took another controversial decision, as he ruled that Giovanni Marchese cleared Robinho's shot off the goal line in time to prevent the ball from crossing the line completely. Both sides looked for a winner in the finals minutes, but the game ended 1–1.Following their elimination in the quarter-finals of the Champions League on Tuesday, Milan took the field at home against Fiorentina on Saturday, 7 April. Despite the visitors being more aggressive in the early stages, the Rossoneri took the lead on 31 minutes with a penalty by Zlatan Ibrahimović, after a foul by Matija Nastasić on Maxi López. However, Fiorentina tied the game in the second minute of the second half through Stevan Jovetić. The game then appeared to be heading for a draw, before Amauri found the winning goal for the visitors in the 89th minute. The subsequent win by Juventus against Palermo in the evening left Milan one point behind Juve in the league standings.Milan returned to winning ways on Tuesday, 10 April, as they snapped up a 1–0 victory in Verona against Chievo, thanks to an eight-minute goal by Sulley Muntari. However, they were held to a 1–1 draw by Bologna on Sunday, 22 April. They had fallen behind on 26 minutes, as Gastón Ramírez scored on a counter-attack led by Alessandro Diamanti. The tying goal was scored by Ibrahimović in the last minute, despite Milan being left down to ten men after Daniele Bonera's ejection. This draw left Milan three points behind Juventus in the league table, following Juve's win over Roma in the evening.The Rossoneri snapped up a home victory over Genoa three days later, thanks to a late goal by Kevin-Prince Boateng, and remained three points behind Juventus, who were victorious in Cesena. Milan claimed another victory on Sunday, 29 April, when they defeated Siena 4–1 away. The first goal was scored by Antonio Cassano on 26 minutes, after Siena goalkeeper Željko Brkić failed to hold the ball following a cross by Ibrahimović. Three minutes later, Ibrahimović made it 2-0 with a left foot strike into the top-left corner from ten yards. The hosts pulled one back through Erjon Bogdani seven minutes from time, but Milan sealed the deal with two goals by Antonio Nocerino and Ibrahimović in stoppage time. Juventus, however, beat Novara to retain a three-point lead in the table.Milan claimed a third straight win in another mid-week clash at home against Atalanta on Wednesday, 2 May. The Rossoneri took the lead on nine minutes through Sulley Muntari, who volleyed the ball in off a cross by Kevin-Prince Boateng. Robinho set the final score to 2–0 in injury time, with a close range diving header following a deflection by Atalanta goalkeeper Andrea Consigli. The win allowed Milan to cut Juventus' lead in the table to one single point with two games remaining, as they were held to a home draw by Lecce.Four days later Milan took the field again to face city rivals Internazionale. The Rossoneri fell behind on a 14th-minute goal by Diego Milito and only a save by Christian Abbiati, who plucked Esteban Cambiasso's header out from on the goal line, prevented Inter to go 2–0 ten minutes before the break. Instead, on 44 minutes Milan were awarded a penalty as Júlio César was deemed by referee Nicola Rizzoli to have fouled Kevin-Prince Boateng, despite replays showing that he only pushed the ball. Zlatan Ibrahimović stepped up and converted the spot-kick to tie the game. Only 30 seconds into the second half, Ibrahimović took the ball past Lúcio and lifted it over Júlio César into the far corner to put Milan ahead. Six minutes later, however, Ignazio Abate took Milito down inside the box and the Argentinian striker converted the resulting penalty to tie the game. In the 79th minute, Inter were awarded another penalty, this time for a handball by Alessandro Nesta. Milito once again converted completing his hat-trick and giving Inter a new lead. Maicon then sealed the win with a strike into the top left-hand corner from outside the box in the 88th minute. By winning against Cagliari on that same evening, Juventus regained a four-point lead over Milan with only one game left to play, thus securing the title.For the last game of the season, Milan played host to an already relegated Novara side at the San Siro. The visitors took the lead with Santiago García on 20 minutes, but in the second half, Milan pulled back and won with goals by Mathieu Flamini and Filippo Inzaghi in the 56th and 82nd minutes respectively.  Win\n  Draw\n  Loss\n\n\n=== Matches ===\n\n\n=== League table ===\n\n\n== Coppa Italia ==\n\nFor the 13th season in a row, Milan started the Coppa Italia directly in the round of 16, as one of the eight best seeded teams. They took on Novara, who defeated Catania 3–2 in the fourth preliminary round. The Rossoneri snapped up a 2–1 win at the San Siro after extra time. Milan opened the scoring through Stephan El Shaarawy in the 24th minutes. However, they failed a couple of chances to stretch their lead and Novara managed to equalise two minutes from time after with a free kick by Ivan Radovanović. Nonetheless, Alexandre Pato scored the winning goal in the tenth minute of extra time, following a combination with Robinho.Milan faced Lazio at home in the quarter-finals on Thursday, 26 January. Lazio took the lead in the 5th minute through Djibril Cissé. However, Milan equalised with a volley by Robinho in the 14th minute and four minutes later Clarence Seedorf gave them the lead. In the second half, substitute Zlatan Ibrahimović scored Milan's third and final goal. The win sent the Rossoneri to the semi-finals for the second year in a row.Milan played host to Juventus in the first leg of the semi-finals on Wednesday, 8 February. The Rossoneri had to go into the game with as many as 13 players out through injuries and suspensions. After a scoreless first half, Juventus took the lead through Martín Cáceres in the 53rd minute. The Uruguayan was quick to tap the ball in after Marco Borriello's shot was deflected by Milan goalkeeper Marco Amelia. Milan equalised nine minutes later with Stephan El Shaarawy, who nodded the ball in after a header by Massimo Ambrosini off Luca Antonini's cross. However, seven minutes from time Cáceres scored the winning goal for the visitors with a curled strike from outside the box.The semi-finals second leg was played at the Juventus Stadium on Tuesday, 20 March. The hosts took the lead in the 28th minute through Alessandro Del Piero, despite replays showing he had first fouled Philippe Mexès and then controlled the ball with his arm before scoring. Milan equalised six minutes into the second half thanks to a diving header by Djamel Mesbah, who scored his first goal for the club. Substitute Maxi López fired home from just outside the box nine minutes from time, giving Milan a 2–1 lead and sending the game to extra time. However, six minutes into extra time, Mirko Vučinić unleashed a shot into the top left-hand corner. The game ended in a 2–2 draw, which meant that Milan were knocked out of the competition 4–3 on aggregate.  Win\n  Draw\n  Loss\n\n\n== UEFA Champions League ==\n\n\n=== Group stage ===\nMilan began their UEFA Champions League campaign in the group stage after winning the 2010–11 Serie A title. Due to their UEFA coefficient, they were seeded in Pot 2, among the eight second-best teams. Milan were drawn in Group H with title-holders Barcelona of Spain, BATE Borisov of Belarus and Viktoria Plzeň of Czech Republic.For the opening game, Milan travelled to the Camp Nou to take on Barcelona, on Tuesday, 13 September. The game got off to a quick start, as Alexandre Pato opened the scoring just 24 seconds into the game. The hosts nearly equalised when Lionel Messi's free kick hit the post to the left of goalkeeper Christian Abbiati. However, in the 34th minute, Barcelona did tie the game through Pedro, who tapped in a low cross by Messi. Five minutes into the second half, Barcelona also went ahead with a curled 32-yard free kick by David Villa. In injury time, however, Thiago Silva headed in a corner by Clarence Seedorf to snap up a 2–2 draw.Two weeks later, Milan played host to Viktoria Plzeň at the San Siro. The visitors nearly went ahead after only three minutes, when Václav Pilař got past Ignazio Abate and crossed the ball to Marek Bakoš, whose goalbound header was saved by goalkeeper Christian Abbiati. Viktoria goalkeeper Marek Čech produces crucial saves of his own during the rest of the first half, repeatedly denying close range efforts by Antonio Cassano and Zlatan Ibrahimović. Eight minutes after the break, however, Milan was awarded a penalty kick for a handball by Marián Čišovský; Ibrahimović stepped up and converted from the spot. Later on, Ibrahimović brought down a lofted pass and played in Cassano, who tucked the ball past Čech and into the net, setting the final score to 2–0.Milan was at home again for the third game, playing against BATE Borisov on Wednesday, 19 October. The hosts got off to a good start, as Alberto Aquilani first sent a shot over the bar four minutes into the game and then struck the post following a combination between Kevin-Prince Boateng and Antonio Cassano. It was BATE, though, who nearly went ahead when Renan Bressan intercepted Mark van Bommel's misplaced pass and was denied by goalkeeper Christian Abbiati one-on-one. Moments later, however, Milan took the lead through Zlatan Ibrahimović who fired home a loose ball after Ignazio Abate's cross was deflected by Artyom Radkov. The Rossoneri scored again in the second half with a strike by Boateng from outside the box, setting the final score to 2–0.The two sides met again at the Dynama Stadium in Minsk on Tuesday, 1 November. Milan went ahead after 22 minutes through Zlatan Ibrahimović following a combination with Robinho. The Brazilian had a chance to double the lead five minutes before the break, but his effort struck the post after he had dribbled BATE's goalkeeper Alyaksandr Hutar. Ten minutes into the second half, BATE were awarded a penalty for an unfair challenge on Artem Kontsevoy by Ignazio Abate and Renan Bressan converted the spot kick to equalise. Despite Milan's efforts to regain the lead, the game ended in a 1–1 draw, with BATE nearly pulling off a late winner when Maksim Skavysh fired straight at goalkeeper Christian Abbiati. However, due to Barcelona defeating Viktoria Plzeň in the other game of the night, Milan secured a spot in the knockout stage of the competition.Two weeks later, Milan played host to Barcelona at the San Siro in a game with first place in the group at stake. The visitors took the lead after 14 minutes, as a cross from the left by Seydou Keita was deflected by Mark van Bommel into his own net. Milan nearly leveled the score soon after when Robinho turned Kevin-Prince Boateng's cross over the bar from close range. However, in the 20th minute the Rossoneri did tie the game through Zlatan Ibrahimović, following a through pass by Clarence Seedorf. Four minutes later, though, Barcelona were ahead again, as Lionel Messi converted a penalty awarded for a foul on Xavi. Nine minutes into the second half Milan evened the score once again with Boateng, who beat Eric Abidal with a back-heel before firing past goalkeeper Víctor Valdés. Seven minutes later Barcelona took the third and final lead as Messi played a ball to Xavi, who finished with a low shot across Christian Abbiati.Having already secured qualification to the knockout phase of the competition, Milan drawn the last game of the group stage 2–2 away against Viktoria Plzeň. After a scoreless first half, Alexandre Pato and Robinho scored two goals in as many minutes for Milan to take a 2–0 lead in the early stages of the second half. However, with less than two minutes left to play Viktoria pulled one back through David Bystroň before tying up the game with Michal Ďuriš in injury time.  Win\n  Draw\n  Loss\n\n\n=== Knockout phase ===\nThe draw for the first knockout round took place in Nyon, Switzerland, on 16 December 2011. Milan were paired with the winners of Group F, Arsenal. The first leg was contested at the San Siro on Wednesday, 15 February. Milan controlled the game in the early stages, with Clarence Seedorf sending a shot just wide in the fourth minute. Moments later, Seedorf had to leave the game due to a hamstring injury. His substitute Urby Emanuelson almost gave Milan the lead, but he mis-hit Zlatan Ibrahimović lay-off from 12 meters out. The Rossoneri did take the lead at the quarter-hour mark, when Kevin-Prince Boateng — returning from a month-long injury — controlled Antonio Nocerino's pass with his chest before turning to fire the ball over Arsenal goalkeeper Wojciech Szczęsny and in off the underside of the crossbar from a tight angle. Milan kept pushing forward and created more chances: Boateng broke through to send a shot into the side netting, while Nocerino's attempt skimmed the bar. However, by the 38 minute they managed to double their lead as Ibrahimović charged down the left flank and crossed for Robinho to nod in from six yards. The momentum did not change in the second half with Milan extending their lead in the 49th minute again through Robinho, who fired home from the edge of the penalty area after Arsenal defender Thomas Vermaelen slipped. Arsenal tried to fight back, but Robin van Persie was denied by Milan goalkeeper Christian Abbiati on three occasions. Eleven minutes from time, Milan were awarded a penalty kick as Ibrahimović was upended by Johan Djourou. The Swede himself converted from the spot to make it 4–0.The second leg was played at the Emirates Stadium on Tuesday, 6 March. Arsenal got off to a quick start, taking the lead on seven minutes as Laurent Koscielny headed in Alex Oxlade-Chamberlain's corner at the near post of Christian Abbiati's goal. Three minutes later Abbiati denied Robin van Persie after a Theo Walcott through ball, and then again on a curling 20-metre effort. However, he could not prevent Tomáš Rosický from scoring on 26 minutes after the visitors failed to clear their lines. Arsenal scored a third two minutes before the break, when Oxlade-Chamberlain was brought down by Djamel Mesbah inside the box and Van Persie sent Abbiati the wrong way from the spot on the resulting penalty kick. Stephan El Shaarawy missed the chance to undo Arsenal's good work on the stroke of half-time, sending wide after a fast-paced counterattack. The English went to the locker room needing only one more goal to send the game in extra time. In the second half Milan seemed less inclined to sit back and Arsenal defenders had to make timely interventions as Zlatan Ibrahimović, Robinho and El Sharaawy showed greater purpose. Still Arsenal might have scored on the hour, when Abbiati saved Gervinho's deflected shot and then clawed away Van Persie's follow-up. At the other end, Arsenal goalkeeper Wojciech Szczęsny denied El Sharaawy's and Ibrahimović's efforts. Later on, Antonio Nocerino shot straight at Szczęsny from two metres out after Alberto Aquilani threaded in a low cross from the right. The game ended 3–0 to Arsenal, meaning that Milan made it through to the quarter-finals 4–3 on aggregate.The draw for the quarter-finals and semi-finals took place in Nyon, Switzerland, on 16 March. Milan were paired with Barcelona, whom they already met in the group stage, and should they progress they would face the winners of the quarter-final between Benfica and Chelsea The first leg against Barcelona was played at the San Siro on Wednesday, 28 March. Milan started the game pressing the holders high up the pitch and on three minutes Barcelona lost the ball just outside their own area, allowing Kevin-Prince Boateng to unleash a shot that looped into the path of Zlatan Ibrahimović. The striker headed the ball to the unmarked Robinho, who volleyed it over the bar from eight meters. Barcelona reaction came not long after, as on ten minutes Milan goalkeeper Christian Abbiati fumbled Lionel Messi's scuffed shot and Dani Alves was wide from close range. Abbiati denied Xavi after a quick one-two with Messi, while Alessandro Nesta and Luca Antonini made crucial interventions. However, Milan could have scored on 20 minutes when Clarence Seedorf's slide-rule pass left Ibrahimović with only goalkeeper Víctor Valdés to beat, but the Swede's scuffed shot was saved. In the second half, Massimiliano Allegri brought on Stephan El Shaarawy for Robinho to inject more pace into the hosts' play. Soon, though, the visitors retook control of the match and Nesta had to foul Messi to prevent him from snaking into the area; the Argentinian forward curled the resulting free-kick over the bar. Pep Guardiola replaced Andrés Iniesta with Cristian Tello, who sent a shot wide on 73 minutes. Moments later, Carles Puyol glanced Xavi's corner narrowly wide of goal. The Rossoneri continued to resist with Daniele Bonera twice making timely tackles on Messi, Ambrosini deflecting the same player's goal-bound shot wide and Antonini denying Tello from close range after a save by Abbiati, and the game eventually ended in a scoreless draw.The return leg was played at the Camp Nou on Tuesday, 3 April. After the scoreless tie in the first leg, a draw with goals would have been enough for Milan to qualify. However, Barcelona took the lead on 11 minutes: Philippe Mexès lost possession to Lionel Messi who raced into the area where he was fouled by Luca Antonini and converted the consequent penalty kick. However, Milan tied the game in the 32nd minute, as Zlatan Ibrahimović slid a pass into the overlapping Antonio Nocerino, who fired home a low shot. Later on, Christian Abbiati denied Xavi after a one-two with Cesc Fàbregas. The twist came four minutes before half-time: during the execution of a corner kick by Xavi, Alessandro Nesta tugged Sergio Busquets to the ground and Barcelona were awarded a second penalty kick, which Messi scored. Eight minutes into the second half Barcelona breached Milan's defence again, Messi's deflected shot looped into the path of Andrés Iniesta, who controlled the ball and beat Abbiati to give the Spanish a 3–1 lead. Pep Guardiola's team controlled the remainder of the match and Milan were knocked out of the competition.  Win\n  Draw\n  Loss\n\n\n== Squad statistics ==\nAs of 13 May 2012.\n1 Player left the club during the season\n2 Player joined the club during the January transfer window\n\n\n== Transfers ==\nMilan's first two signings of the 2011–12 season were announced on 10 May 2011, as CEO Adriano Galliani confirmed the acquisition of defenders Philippe Mexès and Taye Taiwo on free transfers. During the month of May, Milan focused on contract extensions, re-signing Mark van Bommel, Flavio Roma, Alessandro Nesta, Filippo Inzaghi, Massimo Ambrosini and Clarence Seedorf for one more season and Thiago Silva until 2016. This left only three players on expiring contract: Andrea Pirlo, who subsequently joined Juventus, Marek Jankulovski and Nicola Legrottaglie, who later signed for Catania.In June, the Rossoneri made several deals with Genoa: Milan signed outright Kevin-Prince Boateng, Alberto Paloschi, Nnamdi Oduamadi, Rodney Strasser and Gianmarco Zigoni, all of whom were in co-ownership, plus Marco Amelia, who was on loan; in turn, Milan sold outright Sokratis Papastathopoulos and the part-ownership of Giacomo Beretta was renewed. Besides, the Rossoneri took on co-ownership of Stephan El Shaarawy, while Alexander Merkel joined Genoa still on a co-ownership deal.\n\n\n=== In ===\n\n\n=== Out ===\n\n\n=== Out on loan ===\n\n\n== References ==","sourceContentSanitized":"The 2011–12 season was Associazione Calcio Milan's 78th season in Serie A, and their 29th consecutive season in the top-flight of Italian football. Milan were the defending Serie A champions, and they were aiming for a second straight title. Despite a slow start, they had been able to build up a four-point lead in the table over Juventus by 11 March. In the last nine games of the season, however, Milan picked up only five wins, with two draws and two losses, allowing Juventus, who instead recorded ten wins and one draw over their last 11, to regain the lead and win the title by four points. As the previous year's Serie A champions, Milan began their season contesting the Supercoppa Italiana against Coppa Italia holders Internazionale, winning the match 2–1. The Rossoneri also competed in the UEFA Champions League, reaching the quarter-finals where they were eliminated by Barcelona, and took part in the Coppa Italia as well, being knocked out in the semi-finals against Juventus. Milan began their pre-season training at Milanello on Tuesday, 12 July 2011. The following week, on 20 July, they contested the first friendly, an away match against neighboring side Solbiatese Arno. The Rossoneri easily won with a score of 12–0.As part of the Audi Cup, Milan then played two friendlies against Bayern Munich and Internacional at the Allianz Arena in Munich on 26 and 27 July, respectively. The first game finished 1–1. Zlatan Ibrahimović opened the scoring only for Toni Kroos to equalize late in the first half. Milan subsequently lost 5–3 on penalties, with Alberto Paloschi committing the only, and eventually deciding, error. The second game was a 2–2 draw. Ibrahimović once again opened the scoring, before Leandro Damião equalized in the 20th minute, and then Milan took a new lead through Alexandre Pato in the 60th minute only for Andrés D'Alessandro to tie the game ten minutes from time. The Rossoneri were defeated 2–0 on penalties, being unable to convert any of their four attempts.After travelling to China, where they played their first competitive match of the season, a 2–1 win over city rivals Internazionale in the Supercoppa Italiana on 6 August, Milan resumed their pre-season schedule facing Malmö FF in Sweden on 14 August. The Rossoneri took the lead in 27th minute when Urby Emanuelson raced into the box and crossed the ball to Antonio Cassano, who easily headed it in. Malmö equalised nine minutes later through Jimmy Durmaz, who curled a shot from just outside the penalty area. Three minutes into the second half, Malmö took a 2–1 lead when Tobias Malm stole the ball in midfield, combined with Alexander Nilsson and finally beat Milan goalkeeper Christian Abbiati. Milan managed to equalise in the last minute of the game, as a cross by Cassano was headed in by youth team player Kingsley Boateng. With no extra time, the match was to be decided by a three-kick penalty shoot-out, which Milan won 3–2, as Abbiati pulled off a save on Malmö's third attempt.Four days later, Milan returned to Italy to contest the TIM Trophy. They took on Juventus in the second game of the evening, after the latter had lost the first game to Inter on penalties. Milan took the lead in the 13th minute through Antonio Cassano, but Juventus fought back, equalising eight minutes later with Arturo Vidal and scoring the winning goal in injury time through Alessandro Matri. The Rossoneri also lost the third and final game against Inter, with Diego Milito scoring the lone goal, thus allowing them to win the trophy.Milan concluded their pre-season with the annual Luigi Berlusconi Trophy, in which they played against Juventus at the San Siro on 21 August. Kevin-Prince Boateng opened the scoring for the Rossoneri in the ninth minute, volleying past Juventus goalkeeper Gianluigi Buffon from a cross by Ignazio Abate. Fourteen minutes later, Milan doubled their lead, as Clarence Seedorf scored with a curled free-kick off the post. In the second half, Milan players looked more tired and Juventus managed to pull one back through Mirko Vučinić, but the Rossoneri held on to win the game 2–1.Following the players' strike that forced the postponement of the first weekend of league fixtures, however, Milan announced they would play another friendly match, away against Como, on 1 September. The Rossoneri took the lead in the 22nd minute through Massimo Ambrosini, who was set up by Stephan El Shaarawy, but the hosts equalised two minutes later with a goal from Umberto Miello. In the second half, Urby Emanuelson converted a penalty to give Milan the final lead.On 4 January 2012, Milan played their first game of the new year with a friendly against French side Paris Saint-Germain in Dubai for the Emirates Challenge. The game got off to a good start for Milan as Ibrahimović drew the goalkeeper out of his goal and passed to Alexandre Pato for the opener in the fourth minute. The game progressed with neither team looking much better than the other, but both could not convert any more chances and the game ended 1–0 in Milan's favour. Win  Draw  Loss As Serie A Champions, Milan kicked their season off with an appearance in the Supercoppa Italiana, facing Coppa Italia holders, Internazionale at the Beijing National Stadium on 6 August. Inter took the lead after 21 minutes with a 25-yard free kick by Wesley Sneijder. Later on, the Rossoneri nearly leveled the score when a header by Zlatan Ibrahimović struck the post. On the hour mark, Milan managed to equalise, as Ibrahimović headed into an empty net a cross by Clarence Seedorf. Ten minutes later, a shot by Alexandre Pato was deflected by Inter goalkeeper Júlio César on the post only for Kevin-Prince Boateng to convert from close range, setting the final score to 2–1. For Milan, it was the sixth time they won the trophy, making them the most successful club in the history of the competition. Win  Draw  Loss The fixtures for the 2011–12 Serie A season were announced by the Serie A on 27 July. Milan were to kick-off their schedule away at Cagliari on Saturday, 27 August, but following a strike declared by Serie A players over the lack of a collective bargaining agreement, the first day of the league season has been postponed to a future date.Following another week off for an international break, Milan started their season, playing host to Lazio on Friday, 9 September. A few minutes into the game, newly signed Alberto Aquilani broke into the Lazio penalty area, but one on one with goalkeeper Albano Bizzarri, he fired straight at him. Instead, it was Lazio who took the lead, as in 12th minute Miroslav Klose took down Stefano Mauri's cross, turned inside Alessandro Nesta and beat goalkeeper Christian Abbiati. Less than ten minutes later, Lazio scored again through Djibril Cissé, who headed in another cross by Mauri. Milan pulled one back in the 29th minute, when Antonio Cassano, set up by Aquilani inside the box, passed the ball to Zlatan Ibrahimović for the tap-in. Four minutes later, Cassano himself tied the game with a header from a corner. Eighteen minutes into the second half, Cassano went close to find the winning goal, hitting the outside of the left post. Lazio had a chance of his own two minutes later, as Cissé nudged the ball past Abbiati and heading to the goal, before Nesta managed to touch it wide. The match finished in a 2–2 draw.For the next game, Milan travelled to Naples to take on Napoli in the evening of Sunday, 18 September. Both teams had played Champions League ties in midweek, Milan drawing 2–2 at Barcelona on Tuesday and Napoli drawing 1–1 at Manchester City on Wednesday. The Rossoneri were also in the midst of an injury crisis, with as many as seven players out, including the previous season's topscorer, Zlatan Ibrahimović. Nonetheless, Milan took the lead eleven minutes into the game through Alberto Aquilani, who scored his first goal for the club, heading Antonio Cassano's cross past Napoli goalkeeper Morgan De Sanctis. The hosts reaction came only two minutes later, as Edinson Cavani found the equaliser following a free-kick. Napoli started to press forward and in the 36th minute they went ahead with another goal by Cavani on a fast-paced counter-attack. Milan had a chance to pull level when Aquilani was once again set up inside the box by Cassano, but the effort was denied by De Sanctis' save. A few minutes after the break, Cavani completed his hat-trick, making it 3–1 after Milan's defence failed to clear the ball inside the area. The Rossoneri tried to fight back but produced no major threats until the final whistle.Three days later, Milan took the field again, playing host to unbeaten Udinese at the San Siro. The Rossoneri lost Alexandre Pato to an injury in the 21st minute and eight minutes later they went down 1–0, as goalkeeper Christian Abbiati failed to control a cross by Gabriel Torje, fumbling the ball for an Antonio Di Natale empty net tap-in. Moments before the interval, Milan nearly leveled the score when a free-kick from just outside the penalty area by Clarence Seedorf struck the post to the left of goalkeeper Samir Handanović. Eighteen minutes into the second half, the Rossoneri did tie the game: Antonio Cassano set up Stephan El Shaarawy inside the box for the Italian to fire home a low drive to the far post. Udinese later had three chances to win before the final whistle, hitting the woodwork once and then forcing Abbiati to make two crucial saves to preserve the 1–1 tie.Pato's absence intensified Milan's already deep injury crisis, as he joined strikers Zlatan Ibrahimović and Robinho, midfielders Massimo Ambrosini, Kevin-Prince Boateng, Gennaro Gattuso and Mathieu Flamini and defenders Luca Antonini, Daniele Bonera and Philippe Mexès on the sidelines. Nonetheless, on Saturday, 24 September, Milan achieved their first league win of the season, beating Cesena 1–0 at the San Siro. Clarence Seedorf scored the lone goal, firing a 25-yard curled shot, following a corner kick.After defeating Viktoria Plzeň in their midweek Champions League game, Milan travelled to the Juventus Stadium in Turin to take on a still-unbeaten Juventus on Sunday, 2 October. The hosts created several scoring chances in the first half and came close to scoring in the 37th minute, as Mirko Vučinić hit the crossbar with a right-footed shot from the edge of the area. The home side came close to scoring again moments before the break, but Vučinić's drive went just wide of the far post. Juventus kept pressing forward after the break and nearly scored with Leonardo Bonucci, who was palmed over the bar by Milan goalkeeper Christian Abbiati. Milan then had an opportunity of their own, but Kevin-Prince Boateng was denied by Juventus goalkeeper Gianluigi Buffon. Three minutes from time, however, Juventus took the lead: Daniele Bonera's clearance deflected off Claudio Marchisio and into the net. Seconds later, the Rossoneri were left down to ten men with Boateng being sent off for second yellow card. In injury time, Marchisio set the final score to 2–0, as his volley from outside the box went in between Abbiati's legs.After an international break, Milan played host to Palermo on Saturday, 15 October. The Rossoneri were dangerous from the whistle, with Ibrahimović and Cassano forcing multiple saves from goalkeeper Alexandros Tzorvas. Tzorvas also denied Robinho in the 38th minute, parrying an initial shot straight back to the Brazilian and then deflecting the follow-up effort. Milan, however, took the lead one minute later when Ibrahimović provided a cross to Alberto Aquilani, who headed the ball to Antonio Nocerino for a close range tap-in. Ibrahimović also provided the assist for Milan's second goal in the 55th minute, delivering a pin-point pass to Robinho who beat Tzorvas one-on-one. Eight minutes later, Cassano set the final score to 3–0, firing home a pass from Ignazio Abate.After defeating BATE Borisov in their Champions League game, Milan traveled to the Stadio Via del Mare on Sunday, 23 October to take on Lecce, whom they had not beaten away from home in ten years. Guillermo Giacomazzi gave Lecce the lead in the fourth minute with a deft headed flick from Carlos Grossmüller's in-swinging free-kick, taking the ball past goalkeeper Christian Abbiati. Milan had a couple of chances but could not convert them, and in the 30th minute Abbiati was called for a foul on Daniele Corvia after he spilled a caught ball from a corner, with the referee awarding a penalty, despite replays seeming to show that it was a dive by the player. Former Milan player Massimo Oddo converted to put Lecce up 2–0. Milan continued to make defensive mistakes when in the 37th minute Luca Antonini let his blocked ball slip to Grossmüller who fired hom to make it 3–0 for Lecce before halftime. The second half began with Kevin-Prince Boateng and Alberto Aquilani replacing Massimo Ambrosini and Robinho. These substitutions proved crucial, as Boateng scored a hat-trick within a span of 14 minutes to put Milan level at 3–3, before Mario Yepes converted a cross by Antonio Cassano with a header into the top right corner to complete Milan's comeback in the 83rd minute.Three days later, Milan played host to Parma at the San Siro. Milan started the game with confidence, controlling much of the play and in the 30th minute Antonio Nocerino gave Milan the lead with a left-footed shot into the bottom left corner of the net after the ball rebounded off a Parma player. He doubled his tally two minutes later with a left-footed strike from outside the box, making the scoreline 2–0 for Milan. In the 73rd minute, Ibrahimović added to Milan's lead with a right footed shot from the centre of the box to the bottom right corner, assisted by Antonio Cassano with a headed pass following a fast break. Five minutes later though, Sebastian Giovinco scored a consolation goal for Parma as he threaded the ball through Christian Abbiati's legs to make it 3–1. Yet, in the dying minutes of the game, Nocerino completed his hat-trick with a headed goal into the bottom left corner of Antonio Mirante's net to win it for Milan 4–1.Milan completed a three-game week visiting the Stadio Olimpico to take on Roma on Saturday, 29 October. The Rossoneri started the game well, getting ahead in the 17th minute with Zlatan Ibrahimović, who got behind an Alberto Aquilani cross from the right and placed a headed shot into the right side of Roma goalkeeper Maarten Stekelenburg's net. Roma struggled to break Milan's defence until the 28th minute when Nicolás Burdisso scored his first goal of the season by running into the six-yard box to meet Miralem Pjanić's cross with his head and beating Milan goalkeeper Abbiati. Roma's joy was short-lived, however, as Milan went back in front two minutes later: Robinho's corner was met by Alessandro Nesta, who nodded past Stekelenburg. In the 65th minute, Boateng was sent off right after being substituted for saying something to the fourth official. Roma could not get back on terms, and Milan were soon back on the attack and celebrating their third goal as Ibrahimović headed in a cross by Aquilani into the bottom left-hand corner of the goal. The game had not concluded, however, and in the 87th minute Bojan struck the ball into the back of the net after Abbiati was unable to hold on to substitute Erik Lamela's strike. Shortly after, Milan coach Massimiliano Allegri was sent off for protesting about a throw-in, but the game ended with Milan taking the victory by 3–2.After drawing 1–1 in their mid-week Champions League game against BATE Borisov, Milan played host to Catania on Sunday, 6 November. Seven minutes into the game, Robinho was brought down by Davide Lanzafame inside the box and Milan were awarded a penalty, which Ibrahimović converted for the 1–0 lead. The lead was doubled in the 24th minute through Robinho, who beat Catania's goalkeeper Mariano Andújar on the far post, following a pinpoint pass by Ibrahimović. In the second half, the Rossoneri added other two goals to their tally: in the 69th minute, when Catania's Francesco Lodi deflected Robinho's shot into his own net, and three minutes later through Gianluca Zambrotta, whose left-footed strike made it 4–0.Following a two-week break for internationals, Milan resumed his league schedule in Florence to take on Fiorentina on Saturday, 19 November. The game ended in a scoreless draw, though Clarence Seedorf had a goal disallowed for offside in the first half, despite replays showing that he actually was in line. The following week, after losing to Barcelona in a mid–week Champions League game on Wednesday, the Rossoneri defeated Chievo 4–0 at home on Sunday, with first-half goals by Thiago Silva, Ibrahimović twice and Pato. Milan took the field again to face Genoa at the Stadio Luigi Ferraris on Friday, 2 December. After a goalless first half, Milan went ahead in the 56th minute thanks to a penalty earned and converted by Ibrahimović. Eleven minutes from time, Antonio Nocerino made it 2–0.After playing their last Champions League group stage game – an away draw against Viktoria Plzeň – on Tuesday, Milan travelled to the Stadio Renato Dall'Ara to face Bologna on Sunday, 11 December. The hosts took the lead in the 11th minute through their captain Marco Di Vaio, who beat Milan back-up goalkeeper Marco Amelia with a long-range lob following a counter-attack. Five minutes later, Boateng combined with Seedorf and the Dutch fired home the equaliser in the top corner from just outside the penalty box. Milan went ahead in the 21st minute of the second half with a penalty earned and converted by Ibrahimović. Less than two minutes later, though, Alessandro Diamanti tied the game up again as his angled shot from outside the box was not held by Amelia, setting the final score to 2–2.The following week, Milan played host to Siena. The visitors almost went ahead in the 23rd minute, when Francesco Bolzoni tipped the ball past Milan goalkeeper Marco Amelia, but his shot went outside of the far post. Nine minutes into the second half, however, Seedorf's corner was laid back by Robinho to Antonio Nocerino, who fired home a low shot into the bottom corner to give Milan the lead. Eight minutes later, the Rossoneri were awarded a penalty as Boateng was apparently brought down by Siena goalkeeper Željko Brkić; Ibrahimović stepped up to score from the spot as Milan went on to win the game 2–0.Milan played their last game before the winter break away against Cagliari on Tuesday, 20 December. They took the lead four minutes into the games with an own goal by Cagliari defender Francesco Pisano, who deflected Robinho's cross into his own net in an attempt to prevent Antonio Nocerino from reaching the ball. Albin Ekdal nearly leveled the score with a 30-yard shot ten minutes later, but his effort was denied by Abbiati. Abbiati pulled off another save on a header by Víctor Ibarbo in the early stages of the second half. On the hour mark, Milan doubled their lead, as Ibrahimović combined with Robinho and put the ball past Michael Agazzi.Milan resumed their league schedule on Sunday, 8 January, taking on Atalanta in Bergamo. The hosts had the first scoring opportunities of the game, first with Ezequiel Schelotto and then with Simone Padoin. However, Milan were awarded a penalty in the 22nd minute, as Pato was brought down by Thomas Manfredini. Ibrahimović converted to give the Rossoneri the lead. In the second half, Atalanta came close to tie the game as Germán Denis' header hit the woodwork, but with eight minutes left, Ibrahimović picked out Boateng in the centre of the penalty area and the Ghanaian struck it home, setting the final score to 2–0.The following week, Milan faced city rivals Internazionale. Five minutes into the game, Inter had a goal disallowed for offside. In the last minute of the first half, Mark van Bommel hit the crossbar with a shot from outside the box and Inter goalkeeper Júlio César then denied Urby Emanuelson's effort on the rebound. Inter opened the scoring in the 54th minute: Milan defender Ignazio Abate failed to intercept a crossfield pass and slipped, allowing Diego Milito to receive the ball and score. The game ended 1–0, as Milan did not manage to pose any major threat in the remaining part of the game.After defeating Novara in the Coppa Italia round of 16 in mid-week, Milan travelled to the Stadio Silvio Piola to take them on again in a league game on Sunday, 22 January. The Rossoneri claimed a 3–0 win with two second-half goals by Ibrahimović and one by Robinho.The following week, Milan defeated Lazio in the Coppa Italia quarter-finals on Thursday, before taking on Cagliari at home on Sunday. The Rossoneri took the lead in the 32nd minute, as Ibrahimović fired home a free kick from 25 yards. Seven minutes later, he provided an assist to Antonio Nocerino, who volleyed the ball for the 2–0 lead. Fifteen minutes from time, Massimo Ambrosini scored Milan's third and final goal after coming off the bench eight minutes earlier.Three days later, Milan took the field again for a mid-week game against Lazio in Rome. After a goalless first half, the hosts took the lead in the 76th minute, when Tommaso Rocchi fed Hernanes inside the box and the Brazilian scored with a right-footed strike towards the left corner of Abbiati's goal. Nine minutes later, following a fast counter-attack, Rocchi himself beat Abbiati again with a volley off Senad Lulić's cross, setting the final score to 2–0.Milan played host to Napoli on Sunday, 5 February. The game ended in a scoreless draw, with the Rossoneri ending the game down to ten men as Ibrahimović was ejected in the 64th minute for slapping Napoli defender Salvatore Aronica during an altercation.After losing to Juventus at home in the Coppa Italia semi-finals first leg in mid-week, Milan travelled to Stadio Friuli to face Udinese on Saturday, 11 February. The hosts took the lead in the 17th minute through Antonio Di Natale, who collected the ball after a combination with Gélson Fernandes and fired a shot that deflected off Milan defender Thiago Silva and into the net. Udinese had chances to double their lead but failed to do so. With 13 minutes remaining, substitute Maxi López equalised, nodding the ball in after a shot by Stephan El Shaarawy was saved by Udinese goalkeeper Samir Handanović. Eight minutes later, López provided El Shaarawy with the assist for the winning goal.Following a mid-week home victory against Arsenal in the Champions League round of 16, Milan took on Cesena at the Stadio Dino Manuzzi on Sunday, 19 February. The Rossoneri started the game aggressively with several goal attempts in the opening minutes. Two minutes before the half hour mark, Milan finally managed to score through Sulley Muntari. The Ghanaian, at his debut with the Rossoneri, found the back of the net on a rebound after Cesena goalkeeper Francesco Antonioli saved Thiago Silva's free-kick. A couple of minutes later, Urby Emanuelson combined with Robinho and made it 2–0 with a left-footed strike from outside the box. The hosts looked more dangerous at the beginning of the second half as the unmarked Adrian Mutu headed over from close range. Milan, however, increased their lead in the 55th minute as Ignazio Abate set up Robinho inside the box and the Brazilian beat Antonioli. Ten minutes later, Cesena pulled one back through Daniel Pudil but eventually the game ended 3–1.With team top-scorer Zlatan Ibrahimović serving the last of a three-game suspension and midfielders Clarence Seedorf, Kevin-Prince Boateng and Alberto Aquilani out due to injury, Milan played host to Juventus on Saturday, 25 February. Milan took the lead after 14 minutes, with a shot from outside the box by Antonio Nocerino. Later on, Sulley Muntari seemed to have made it 2–0 when his headed effort was saved by Juventus 'keeper Gianluigi Buffon inside the line, but the referee did not award the goal. Seven minutes from time, Alessandro Matri pulled off an equaliser with a volley from close-range.The following Saturday, Milan travelled to the Stadio Renzo Barbera to take on Palermo. The returning Ibrahimović moved to the top of the scorers table as he scored a hat-trick between the 21st and the 35th minute to give Milan a 3–0 lead. Five minutes later he came close to score a fourth, but Palermo goalkeeper Emiliano Viviano denied him from close range. In the second half, Thiago Silva added to Milan's tally with a header off Stephan El Shaarawy's cross, setting the final score to 4–0.After losing the second leg of the Champions League round of 16 against Arsenal in mid-week, Milan played host to Lecce on Sunday, 11 March. The Rossoneri took an early lead on six minutes, as Antonio Nocerino fired home off Zlatan Ibrahimović's pass. In the second half the Swede himself made it 2–0 with a strike from outside the box. As Juventus drew their game away at Genoa, Milan extended their lead at the top of the league table to four points. Milan went on to win 2–0 away at Parma the following Saturday, thanks to a penalty converted by Ibrahimović in the 17th minute and a second half goal by Urby Emanuelson.After playing the return leg of the Coppa Italia semi-finals in mid-week, Milan played host to Roma on Saturday, 24 March. Despite having several scoring chances, they went behind one minute before the interval as Pablo Osvaldo fired home from close range after Daniele De Rossi's pass. Eight minutes into the second half, however, the Rossoneri were awarded a penalty due to a handball by De Rossi, which Ibrahimović converted to tie the game. The Swede almost put Milan in front with a free-kick which went just over the bar and then Roma goalkeeper Maarten Stekelenburg deflected Sulley Muntari's attempt onto the bar. With seven minutes remaining, Ibrahimović found the winning goal heading home Muntari's cross from close range.The following week, after drawing against Barcelona in the first leg of the Champions League quarter-finals on Wednesday, Milan travelled to the Stadio Angelo Massimino to face Catania on Saturday, 31 March. The visitors nearly took the lead through Urby Emanuelson, who failed to beat goalkeeper Juan Pablo Carrizo in a one-on-one situation on seven minutes. Ten minutes later, Carrizo denied Zlatan Ibrahimović, before Catania had a chance with Gonzalo Bergessio heading over the crossbar. In the 35th minute, Ibrahimović played the ball through for Robinho, who beat Carrizo with a low shot into the bottom corner, putting Milan ahead. Catania reacted immediately with Alejandro Gómez firing a shot from outside the penalty area and hitting the crossbar. Early in the second half, Gómez was controversially denied an equaliser for offside, despite the Argentinian striker appearing to be in an onside position. However, the hosts did tie the game in the 57th minute through Nicolás Spolli, who beat Christian Abbiati from close range after Nicola Legrottaglie headed Gómez's free-kick towards him. Nine minutes later referee Mauro Bergonzi took another controversial decision, as he ruled that Giovanni Marchese cleared Robinho's shot off the goal line in time to prevent the ball from crossing the line completely. Both sides looked for a winner in the finals minutes, but the game ended 1–1.Following their elimination in the quarter-finals of the Champions League on Tuesday, Milan took the field at home against Fiorentina on Saturday, 7 April. Despite the visitors being more aggressive in the early stages, the Rossoneri took the lead on 31 minutes with a penalty by Zlatan Ibrahimović, after a foul by Matija Nastasić on Maxi López. However, Fiorentina tied the game in the second minute of the second half through Stevan Jovetić. The game then appeared to be heading for a draw, before Amauri found the winning goal for the visitors in the 89th minute. The subsequent win by Juventus against Palermo in the evening left Milan one point behind Juve in the league standings.Milan returned to winning ways on Tuesday, 10 April, as they snapped up a 1–0 victory in Verona against Chievo, thanks to an eight-minute goal by Sulley Muntari. However, they were held to a 1–1 draw by Bologna on Sunday, 22 April. They had fallen behind on 26 minutes, as Gastón Ramírez scored on a counter-attack led by Alessandro Diamanti. The tying goal was scored by Ibrahimović in the last minute, despite Milan being left down to ten men after Daniele Bonera's ejection. This draw left Milan three points behind Juventus in the league table, following Juve's win over Roma in the evening.The Rossoneri snapped up a home victory over Genoa three days later, thanks to a late goal by Kevin-Prince Boateng, and remained three points behind Juventus, who were victorious in Cesena. Milan claimed another victory on Sunday, 29 April, when they defeated Siena 4–1 away. The first goal was scored by Antonio Cassano on 26 minutes, after Siena goalkeeper Željko Brkić failed to hold the ball following a cross by Ibrahimović. Three minutes later, Ibrahimović made it 2-0 with a left foot strike into the top-left corner from ten yards. The hosts pulled one back through Erjon Bogdani seven minutes from time, but Milan sealed the deal with two goals by Antonio Nocerino and Ibrahimović in stoppage time. Juventus, however, beat Novara to retain a three-point lead in the table.Milan claimed a third straight win in another mid-week clash at home against Atalanta on Wednesday, 2 May. The Rossoneri took the lead on nine minutes through Sulley Muntari, who volleyed the ball in off a cross by Kevin-Prince Boateng. Robinho set the final score to 2–0 in injury time, with a close range diving header following a deflection by Atalanta goalkeeper Andrea Consigli. The win allowed Milan to cut Juventus' lead in the table to one single point with two games remaining, as they were held to a home draw by Lecce.Four days later Milan took the field again to face city rivals Internazionale. The Rossoneri fell behind on a 14th-minute goal by Diego Milito and only a save by Christian Abbiati, who plucked Esteban Cambiasso's header out from on the goal line, prevented Inter to go 2–0 ten minutes before the break. Instead, on 44 minutes Milan were awarded a penalty as Júlio César was deemed by referee Nicola Rizzoli to have fouled Kevin-Prince Boateng, despite replays showing that he only pushed the ball. Zlatan Ibrahimović stepped up and converted the spot-kick to tie the game. Only 30 seconds into the second half, Ibrahimović took the ball past Lúcio and lifted it over Júlio César into the far corner to put Milan ahead. Six minutes later, however, Ignazio Abate took Milito down inside the box and the Argentinian striker converted the resulting penalty to tie the game. In the 79th minute, Inter were awarded another penalty, this time for a handball by Alessandro Nesta. Milito once again converted completing his hat-trick and giving Inter a new lead. Maicon then sealed the win with a strike into the top left-hand corner from outside the box in the 88th minute. By winning against Cagliari on that same evening, Juventus regained a four-point lead over Milan with only one game left to play, thus securing the title.For the last game of the season, Milan played host to an already relegated Novara side at the San Siro. The visitors took the lead with Santiago García on 20 minutes, but in the second half, Milan pulled back and won with goals by Mathieu Flamini and Filippo Inzaghi in the 56th and 82nd minutes respectively. Win  Draw  Loss For the 13th season in a row, Milan started the Coppa Italia directly in the round of 16, as one of the eight best seeded teams. They took on Novara, who defeated Catania 3–2 in the fourth preliminary round. The Rossoneri snapped up a 2–1 win at the San Siro after extra time. Milan opened the scoring through Stephan El Shaarawy in the 24th minutes. However, they failed a couple of chances to stretch their lead and Novara managed to equalise two minutes from time after with a free kick by Ivan Radovanović. Nonetheless, Alexandre Pato scored the winning goal in the tenth minute of extra time, following a combination with Robinho.Milan faced Lazio at home in the quarter-finals on Thursday, 26 January. Lazio took the lead in the 5th minute through Djibril Cissé. However, Milan equalised with a volley by Robinho in the 14th minute and four minutes later Clarence Seedorf gave them the lead. In the second half, substitute Zlatan Ibrahimović scored Milan's third and final goal. The win sent the Rossoneri to the semi-finals for the second year in a row.Milan played host to Juventus in the first leg of the semi-finals on Wednesday, 8 February. The Rossoneri had to go into the game with as many as 13 players out through injuries and suspensions. After a scoreless first half, Juventus took the lead through Martín Cáceres in the 53rd minute. The Uruguayan was quick to tap the ball in after Marco Borriello's shot was deflected by Milan goalkeeper Marco Amelia. Milan equalised nine minutes later with Stephan El Shaarawy, who nodded the ball in after a header by Massimo Ambrosini off Luca Antonini's cross. However, seven minutes from time Cáceres scored the winning goal for the visitors with a curled strike from outside the box.The semi-finals second leg was played at the Juventus Stadium on Tuesday, 20 March. The hosts took the lead in the 28th minute through Alessandro Del Piero, despite replays showing he had first fouled Philippe Mexès and then controlled the ball with his arm before scoring. Milan equalised six minutes into the second half thanks to a diving header by Djamel Mesbah, who scored his first goal for the club. Substitute Maxi López fired home from just outside the box nine minutes from time, giving Milan a 2–1 lead and sending the game to extra time. However, six minutes into extra time, Mirko Vučinić unleashed a shot into the top left-hand corner. The game ended in a 2–2 draw, which meant that Milan were knocked out of the competition 4–3 on aggregate. Win  Draw  Loss Milan began their UEFA Champions League campaign in the group stage after winning the 2010–11 Serie A title. Due to their UEFA coefficient, they were seeded in Pot 2, among the eight second-best teams. Milan were drawn in Group H with title-holders Barcelona of Spain, BATE Borisov of Belarus and Viktoria Plzeň of Czech Republic.For the opening game, Milan travelled to the Camp Nou to take on Barcelona, on Tuesday, 13 September. The game got off to a quick start, as Alexandre Pato opened the scoring just 24 seconds into the game. The hosts nearly equalised when Lionel Messi's free kick hit the post to the left of goalkeeper Christian Abbiati. However, in the 34th minute, Barcelona did tie the game through Pedro, who tapped in a low cross by Messi. Five minutes into the second half, Barcelona also went ahead with a curled 32-yard free kick by David Villa. In injury time, however, Thiago Silva headed in a corner by Clarence Seedorf to snap up a 2–2 draw.Two weeks later, Milan played host to Viktoria Plzeň at the San Siro. The visitors nearly went ahead after only three minutes, when Václav Pilař got past Ignazio Abate and crossed the ball to Marek Bakoš, whose goalbound header was saved by goalkeeper Christian Abbiati. Viktoria goalkeeper Marek Čech produces crucial saves of his own during the rest of the first half, repeatedly denying close range efforts by Antonio Cassano and Zlatan Ibrahimović. Eight minutes after the break, however, Milan was awarded a penalty kick for a handball by Marián Čišovský; Ibrahimović stepped up and converted from the spot. Later on, Ibrahimović brought down a lofted pass and played in Cassano, who tucked the ball past Čech and into the net, setting the final score to 2–0.Milan was at home again for the third game, playing against BATE Borisov on Wednesday, 19 October. The hosts got off to a good start, as Alberto Aquilani first sent a shot over the bar four minutes into the game and then struck the post following a combination between Kevin-Prince Boateng and Antonio Cassano. It was BATE, though, who nearly went ahead when Renan Bressan intercepted Mark van Bommel's misplaced pass and was denied by goalkeeper Christian Abbiati one-on-one. Moments later, however, Milan took the lead through Zlatan Ibrahimović who fired home a loose ball after Ignazio Abate's cross was deflected by Artyom Radkov. The Rossoneri scored again in the second half with a strike by Boateng from outside the box, setting the final score to 2–0.The two sides met again at the Dynama Stadium in Minsk on Tuesday, 1 November. Milan went ahead after 22 minutes through Zlatan Ibrahimović following a combination with Robinho. The Brazilian had a chance to double the lead five minutes before the break, but his effort struck the post after he had dribbled BATE's goalkeeper Alyaksandr Hutar. Ten minutes into the second half, BATE were awarded a penalty for an unfair challenge on Artem Kontsevoy by Ignazio Abate and Renan Bressan converted the spot kick to equalise. Despite Milan's efforts to regain the lead, the game ended in a 1–1 draw, with BATE nearly pulling off a late winner when Maksim Skavysh fired straight at goalkeeper Christian Abbiati. However, due to Barcelona defeating Viktoria Plzeň in the other game of the night, Milan secured a spot in the knockout stage of the competition.Two weeks later, Milan played host to Barcelona at the San Siro in a game with first place in the group at stake. The visitors took the lead after 14 minutes, as a cross from the left by Seydou Keita was deflected by Mark van Bommel into his own net. Milan nearly leveled the score soon after when Robinho turned Kevin-Prince Boateng's cross over the bar from close range. However, in the 20th minute the Rossoneri did tie the game through Zlatan Ibrahimović, following a through pass by Clarence Seedorf. Four minutes later, though, Barcelona were ahead again, as Lionel Messi converted a penalty awarded for a foul on Xavi. Nine minutes into the second half Milan evened the score once again with Boateng, who beat Eric Abidal with a back-heel before firing past goalkeeper Víctor Valdés. Seven minutes later Barcelona took the third and final lead as Messi played a ball to Xavi, who finished with a low shot across Christian Abbiati.Having already secured qualification to the knockout phase of the competition, Milan drawn the last game of the group stage 2–2 away against Viktoria Plzeň. After a scoreless first half, Alexandre Pato and Robinho scored two goals in as many minutes for Milan to take a 2–0 lead in the early stages of the second half. However, with less than two minutes left to play Viktoria pulled one back through David Bystroň before tying up the game with Michal Ďuriš in injury time. Win  Draw  Loss The draw for the first knockout round took place in Nyon, Switzerland, on 16 December 2011. Milan were paired with the winners of Group F, Arsenal. The first leg was contested at the San Siro on Wednesday, 15 February. Milan controlled the game in the early stages, with Clarence Seedorf sending a shot just wide in the fourth minute. Moments later, Seedorf had to leave the game due to a hamstring injury. His substitute Urby Emanuelson almost gave Milan the lead, but he mis-hit Zlatan Ibrahimović lay-off from 12 meters out. The Rossoneri did take the lead at the quarter-hour mark, when Kevin-Prince Boateng — returning from a month-long injury — controlled Antonio Nocerino's pass with his chest before turning to fire the ball over Arsenal goalkeeper Wojciech Szczęsny and in off the underside of the crossbar from a tight angle. Milan kept pushing forward and created more chances: Boateng broke through to send a shot into the side netting, while Nocerino's attempt skimmed the bar. However, by the 38 minute they managed to double their lead as Ibrahimović charged down the left flank and crossed for Robinho to nod in from six yards. The momentum did not change in the second half with Milan extending their lead in the 49th minute again through Robinho, who fired home from the edge of the penalty area after Arsenal defender Thomas Vermaelen slipped. Arsenal tried to fight back, but Robin van Persie was denied by Milan goalkeeper Christian Abbiati on three occasions. Eleven minutes from time, Milan were awarded a penalty kick as Ibrahimović was upended by Johan Djourou. The Swede himself converted from the spot to make it 4–0.The second leg was played at the Emirates Stadium on Tuesday, 6 March. Arsenal got off to a quick start, taking the lead on seven minutes as Laurent Koscielny headed in Alex Oxlade-Chamberlain's corner at the near post of Christian Abbiati's goal. Three minutes later Abbiati denied Robin van Persie after a Theo Walcott through ball, and then again on a curling 20-metre effort. However, he could not prevent Tomáš Rosický from scoring on 26 minutes after the visitors failed to clear their lines. Arsenal scored a third two minutes before the break, when Oxlade-Chamberlain was brought down by Djamel Mesbah inside the box and Van Persie sent Abbiati the wrong way from the spot on the resulting penalty kick. Stephan El Shaarawy missed the chance to undo Arsenal's good work on the stroke of half-time, sending wide after a fast-paced counterattack. The English went to the locker room needing only one more goal to send the game in extra time. In the second half Milan seemed less inclined to sit back and Arsenal defenders had to make timely interventions as Zlatan Ibrahimović, Robinho and El Sharaawy showed greater purpose. Still Arsenal might have scored on the hour, when Abbiati saved Gervinho's deflected shot and then clawed away Van Persie's follow-up. At the other end, Arsenal goalkeeper Wojciech Szczęsny denied El Sharaawy's and Ibrahimović's efforts. Later on, Antonio Nocerino shot straight at Szczęsny from two metres out after Alberto Aquilani threaded in a low cross from the right. The game ended 3–0 to Arsenal, meaning that Milan made it through to the quarter-finals 4–3 on aggregate.The draw for the quarter-finals and semi-finals took place in Nyon, Switzerland, on 16 March. Milan were paired with Barcelona, whom they already met in the group stage, and should they progress they would face the winners of the quarter-final between Benfica and Chelsea The first leg against Barcelona was played at the San Siro on Wednesday, 28 March. Milan started the game pressing the holders high up the pitch and on three minutes Barcelona lost the ball just outside their own area, allowing Kevin-Prince Boateng to unleash a shot that looped into the path of Zlatan Ibrahimović. The striker headed the ball to the unmarked Robinho, who volleyed it over the bar from eight meters. Barcelona reaction came not long after, as on ten minutes Milan goalkeeper Christian Abbiati fumbled Lionel Messi's scuffed shot and Dani Alves was wide from close range. Abbiati denied Xavi after a quick one-two with Messi, while Alessandro Nesta and Luca Antonini made crucial interventions. However, Milan could have scored on 20 minutes when Clarence Seedorf's slide-rule pass left Ibrahimović with only goalkeeper Víctor Valdés to beat, but the Swede's scuffed shot was saved. In the second half, Massimiliano Allegri brought on Stephan El Shaarawy for Robinho to inject more pace into the hosts' play. Soon, though, the visitors retook control of the match and Nesta had to foul Messi to prevent him from snaking into the area; the Argentinian forward curled the resulting free-kick over the bar. Pep Guardiola replaced Andrés Iniesta with Cristian Tello, who sent a shot wide on 73 minutes. Moments later, Carles Puyol glanced Xavi's corner narrowly wide of goal. The Rossoneri continued to resist with Daniele Bonera twice making timely tackles on Messi, Ambrosini deflecting the same player's goal-bound shot wide and Antonini denying Tello from close range after a save by Abbiati, and the game eventually ended in a scoreless draw.The return leg was played at the Camp Nou on Tuesday, 3 April. After the scoreless tie in the first leg, a draw with goals would have been enough for Milan to qualify. However, Barcelona took the lead on 11 minutes: Philippe Mexès lost possession to Lionel Messi who raced into the area where he was fouled by Luca Antonini and converted the consequent penalty kick. However, Milan tied the game in the 32nd minute, as Zlatan Ibrahimović slid a pass into the overlapping Antonio Nocerino, who fired home a low shot. Later on, Christian Abbiati denied Xavi after a one-two with Cesc Fàbregas. The twist came four minutes before half-time: during the execution of a corner kick by Xavi, Alessandro Nesta tugged Sergio Busquets to the ground and Barcelona were awarded a second penalty kick, which Messi scored. Eight minutes into the second half Barcelona breached Milan's defence again, Messi's deflected shot looped into the path of Andrés Iniesta, who controlled the ball and beat Abbiati to give the Spanish a 3–1 lead. Pep Guardiola's team controlled the remainder of the match and Milan were knocked out of the competition. Win  Draw  Loss As of 13 May 2012. 1 Player left the club during the season 2 Player joined the club during the January transfer window Milan's first two signings of the 2011–12 season were announced on 10 May 2011, as CEO Adriano Galliani confirmed the acquisition of defenders Philippe Mexès and Taye Taiwo on free transfers. During the month of May, Milan focused on contract extensions, re-signing Mark van Bommel, Flavio Roma, Alessandro Nesta, Filippo Inzaghi, Massimo Ambrosini and Clarence Seedorf for one more season and Thiago Silva until 2016. This left only three players on expiring contract: Andrea Pirlo, who subsequently joined Juventus, Marek Jankulovski and Nicola Legrottaglie, who later signed for Catania.In June, the Rossoneri made several deals with Genoa: Milan signed outright Kevin-Prince Boateng, Alberto Paloschi, Nnamdi Oduamadi, Rodney Strasser and Gianmarco Zigoni, all of whom were in co-ownership, plus Marco Amelia, who was on loan; in turn, Milan sold outright Sokratis Papastathopoulos and the part-ownership of Giacomo Beretta was renewed. Besides, the Rossoneri took on co-ownership of Stephan El Shaarawy, while Alexander Merkel joined Genoa still on a co-ownership deal.","sentences":[{"text":"The 2011–12 season was Associazione Calcio Milan's 78th season in Serie A, and their 29th consecutive season in the top-flight of Italian football.","keywords":["Associazione Calcio Milan's 78th season","consecutive season","season","Serie A","top-flight of Italian football"],"images":[]},{"text":"Milan were the defending Serie A champions, and they were aiming for a second straight title.","keywords":["defending Serie","Milan","champions","second straight title"],"images":[]},{"text":"Despite a slow start, they had been able to build up a four-point lead in the table over Juventus by 11 March.","keywords":["slow start","four-point lead","table","Juventus","March"],"images":[]},{"text":"In the last nine games of the season, however, Milan picked up only five wins, with two draws and two losses, allowing Juventus, who instead recorded ten wins and one draw over their last 11, to regain the lead and win the title by four points.","keywords":["games of the season","Juventus","losses","Milan","wins","draws","title","points","draw","lead"],"images":[]},{"text":"As the previous year's Serie A champions, Milan began their season contesting the Supercoppa Italiana against Coppa Italia holders Internazionale, winning the match 2–1.","keywords":["previous year's Serie","Supercoppa Italiana","Coppa Italia holders Internazionale","champions","Milan","season","match"],"images":[]},{"text":"The Rossoneri also competed in the UEFA Champions League, reaching the quarter-finals where they were eliminated by Barcelona, and took part in the Coppa Italia as well, being knocked out in the semi-finals against Juventus.","keywords":["UEFA Champions League","quarter-finals","Coppa Italia","semi-finals","Barcelona","part","Juventus","Rossoneri"],"images":[]},{"text":"Milan began their pre-season training at Milanello on Tuesday, 12 July 2011.","keywords":["season training","Milan","Milanello","Tuesday","July"],"images":[]}]}